const PDFdocument = require('pdfkit')
const fs = require('fs')

const doc = new PDFdocument({
    size: 'A4'
});

doc.pipe(fs.createWriteStream('public/output.pdf'))

const text =`নারী ও কবি
©সোহানুর রহমান সোহান 

নারী এক আকাশ মুগ্ধতার নাম
নারী নিয়ে কবিরা লিখে যায় কবিতা গান।
নারী নিয়ে সকল জল্পনা কল্পনা
নারীর মাঝে সব হারানোর বাসনা। 
নারী আমার প্রেমিকা, নারী আমার মা বোন
নারীর মাঝে খুঁজে পাই সকল আপনজন।
নারী জীবনানন্দের বনলতা সেন 
নারীরা সময়ে অসময়ে শান্তি দেন।

নারী মানে ছন্দ, শব্দ, বাক্য,উপমা
যা দেখে লিখতে লিখতে কবিরা হয় আনমনা।
নারী মানে পরনে নীল শাড়ী 
হাতে থাকবে বেহিসাবী কাচের চুড়ি।
নারী মানে আঁচল ভরা মায়া 
জীবনের তরে পড়ে তার ছায়া! 
নারী মানে অবাক সুন্দর 
যাকে ঘিরে কবির কল্পনা জগৎ!

নারী মানে ললাটে কালো টিপ
অধরে রামধনুর দীপ। 
নারী মানে নয়ন জুড়ে কাজল
নারী মানে নীল শাড়ীর আঁচল। 
নারী আমার ভূবণ 
লজ্জা নারীর ভূষণ। 
নারীই তো রমণী 
নারীরাই কামিনী। 

নারী কে কেউ ডাকে প্রেয়সী
কেউ ডাকে শ্রেয়সী।
নারী কারো কাছে প্রিয়তমা 
কারো কাছে পূর্নিমা।
আমি বলি, নারী এক আকাশ মুগ্ধতা 
যাকে নিয়ে প্রতিনিয়ত লিখি কবিতা। 
নারী আমার লেখার প্রেরণা
নারী আমার গভীর সাধনা।।`

const title = text.split('\n', 1)[0];
const body = text.substring(text.indexOf('\n'), text.length);


doc.font('fonts/kalpurush.ttf').fontSize(20).text(title, {
    align: 'center'
});

doc.font('fonts/kalpurush.ttf').fontSize(16).text(body, {
    align: 'center'
})

doc.end();